Documents/ОтчетОНанесенииКИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОтчетОНанесенииКИЗ</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияКодовМаркировки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтчетОНанесенииКИЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыЧЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВводаВОборот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособВводаВОборот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособИзготовления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСервисПровайдеровСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>error_text</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>report_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>status_km</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаспечатанаЭтикетка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихКодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧужойКИЗ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТоварОтсутствует</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СостоянияКодовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияКодовМаркировки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СостояниеКМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКодовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Признак</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакКодовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДДокументаЧЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШтрихКодНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетОНанесенииКИЗ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводВОборотКИЗ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПулКодовМаркировкиСУЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПулКодовМаркировкиСУЗ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКодовМаркировкиСУЗ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКодМаркировки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЭмиссииУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыЧЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВводаВОборот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособВводаВОборот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаЭмиссию</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХешСуммаКодаМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыОтчетОНанесенииКИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОтчетОНанесенииКИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыМаркировкиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыМаркировкиТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаЭмиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нанесение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОНанесении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводВОборот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияКодовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияКодовМаркировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нанесен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВведенВОборот</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПризнакКодовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПризнакКодовМаркировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СвойКИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧужойКИЗ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказНаЭмиссиюКодовМаркировкиСУЗ</Name>
			<BasedOn>
				<xr:Item>Document.МаркировкаТоваровГИСМ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказаНаМаркировку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыЧЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МаркировкаТоваровГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособИзготовления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСервисПровайдеровСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВводаВОборот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособВводаВОборот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эмитировано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОтчетОНанесенииКИЗ/Ext/ObjectModule.bsl
//+Пашкин О.А. 08.09.2025 #UT10-5414
Перем ПроверкаУсловияНетДанныхКМаркировке Экспорт; 	
//-Пашкин О.А. 08.09.2025 #UT10-5414

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	СтруктураОбязательныхПолей = Новый Структура("Организация, ВидПродукции, СпособИзготовления, СпособВводаВОборот");
	
	Заголовок = "Укажите реквизиты шапки документа";
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Заголовок = "Укажите реквизиты табличной части товары документа";
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура");
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ, Заголовок);

	Если Товары.Количество() = 0 Тогда
		
		ОбщегоНазначения.СообщитьИнформациюПользователю("Не заполнена табличная часть товары");
		Отказ = ИСТИНА;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	//+Марков И. 13.09.2025 #UT10-5421
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НЕ МАКСИМУМ(НЕ ОтчетОНанесенииКИЗТовары.ЧужойКИЗ
	|				И НЕ ОтчетОНанесенииКИЗТовары.ТоварОтсутствует
	|				И НЕ ЕСТЬNULL(ОтчетОНанесенииКИЗТовары.ШтрихКодМаркировки.СрокГодности < ОтчетОНанесенииКИЗТовары.Ссылка.Дата, Ложь)) КАК НетДанныхКМаркировке
	|ИЗ
	|	Документ.ОтчетОНанесенииКИЗ.Товары КАК ОтчетОНанесенииКИЗТовары
	|ГДЕ
	|	ОтчетОНанесенииКИЗТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетОНанесенииКИЗТовары.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	ПроверкаУсловияНетДанныхКМаркировке = ?(Выборка.Следующий(), Выборка.НетДанныхКМаркировке, Ложь);
	//-Марков И. 13.09.2025 #UT10-5421
	
	Если Статус = Перечисления.СтатусыОтчетОНанесенииКИЗ.Отправлен ИЛИ ПроверкаУсловияНетДанныхКМаркировке Тогда
		
		Если ЗначениеЗаполнено(Основание) И НЕ ПроверкаУсловияНетДанныхКМаркировке Тогда
					
			Если ЗначениеЗаполнено(Основание.Основание) Тогда
				
				МаркировкаОбъект = Основание.Основание.ПолучитьОбъект();
				МаркировкаОбъект.Статус = Перечисления.СтатусыМаркировкиТоваров.ОтчетОНанесении;
				МаркировкаОбъект.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Проведен Тогда 
			
			НаборСостоянийТоваров = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
			НаборСостоянийТоваров.Отбор.Регистратор.Установить(Ссылка);
			НаборСостоянийТоваров.Записать(); 
			
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		
		Для Каждого СтрокаТовары Из Товары Цикл
			
			Если НЕ СтрокаТовары.ТоварОтсутствует И ЗначениеЗаполнено(СтрокаТовары.ШтрихКодМаркировки) 
				И (НЕ СтрокаТовары.ШтрихКодМаркировки.СрокГодности < ЭтотОбъект.Дата ИЛИ СтрокаТовары.ЧужойКИЗ) Тогда
				
				НоваяЗапись                      = НаборЗаписей.Добавить();
				НоваяЗапись.Документ             = Ссылка;
				НоваяЗапись.ШтрихКодНоменклатуры = СтрокаТовары.ШтрихКодМаркировки;
				//+Марков И. 13.09.2025 #UT10-5421
				НоваяЗапись.СостояниеКМ          = ?(СтрокаТовары.ЧужойКИЗ, Перечисления.СостоянияКодовМаркировки.ВведенВОборот, Перечисления.СостоянияКодовМаркировки.Нанесен);    
				//-Марков И. 13.09.2025 #UT10-5421
				НоваяЗапись.Признак              = ?(СтрокаТовары.ЧужойКИЗ, Перечисления.ПризнакКодовМаркировки.ЧужойКИЗ, Перечисления.ПризнакКодовМаркировки.СвойКИЗ);  
				
			КонецЕсли;
			
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	//+Пашкин О.А. 08.09.2025 #UT10-5414	
	//Если  Статус = Перечисления.СтатусыОтчетОНанесенииКИЗ.Обработан И Тогда
	Если  Статус = Перечисления.СтатусыОтчетОНанесенииКИЗ.Обработан И НЕ ПроверкаУсловияНетДанныхКМаркировке Тогда
	//-Пашкин О.А. 08.09.2025 #UT10-5414			
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВводВОборотКИЗ.Ссылка
		|ИЗ
		|	Документ.ВводВОборотКИЗ КАК ВводВОборотКИЗ
		|ГДЕ
		|	ВводВОборотКИЗ.Основание = &Основание
		|	И ВводВОборотКИЗ.Проведен";
		
		Запрос.УстановитьПараметр("Основание",ЭтотОбъект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			
			ДанныеЗаполнения           = ЭтотОбъект; 
			
			НовыйДокументЗНЭ           = Документы.ВводВОборотКИЗ.СоздатьДокумент();	
			ЗаполнитьЗначенияСвойств(НовыйДокументЗНЭ,ДанныеЗаполнения);
			НовыйДокументЗНЭ.Основание = ЭтотОбъект.Ссылка;
			НовыйДокументЗНЭ.Номер     = "";
			НовыйДокументЗНЭ.Дата      = ТекущаяДата();                               
			НовыйДокументЗНЭ.Статус    = Перечисления.СтатусыОтчетОНанесенииКИЗ.Отправлен;
			
			Для Каждого СтрокаТовары ИЗ ДанныеЗаполнения.Товары Цикл   
				
				//Марков И. 17.09.2025 #UT10-5425 добавлена проверка срока годности
				Если НЕ СтрокаТовары.ЧужойКИЗ И НЕ СтрокаТовары.ТоварОтсутствует И НЕ СтрокаТовары.ШтрихКодМаркировки.СрокГодности < ЭтотОбъект.Дата Тогда 
					НоваяСтрокаТовары = НовыйДокументЗНЭ.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары,СтрокаТовары); 
				КонецЕсли;                                                             
				
			КонецЦикла;
			
			НовыйДокументЗНЭ.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Основание) Тогда
			
			Если ЗначениеЗаполнено(Основание.Основание) Тогда
				
				МаркировкаОбъект = Основание.Основание.ПолучитьОбъект();
				МаркировкаОбъект.Статус = Перечисления.СтатусыМаркировкиТоваров.ВводВОборот;
				МаркировкаОбъект.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	//+Пашкин О.А. 08.09.2025 #UT10-5414	
	Если  Статус = Перечисления.СтатусыОтчетОНанесенииКИЗ.Обработан И ПроверкаУсловияНетДанныхКМаркировке Тогда
		
		Если ЗначениеЗаполнено(Основание) Тогда
			
			Если ЗначениеЗаполнено(Основание.Основание) Тогда
				
				МаркировкаОбъект = Основание.Основание.ПолучитьОбъект();
				МаркировкаОбъект.Статус = Перечисления.СтатусыМаркировкиТоваров.Завершен;
				МаркировкаОбъект.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	//-Пашкин О.А. 08.09.2025 #UT10-5414	

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	//+Шульман А. 02.10.2025 #UT10-5445
	//Для Каждого СтрокаТовары ИЗ ДанныеЗаполнения.Товары Цикл
		
		//Запрос = Новый Запрос;     
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	ПулКодовМаркировкиСУЗ.ДокументОснование,
		//|	ПулКодовМаркировкиСУЗ.ЗаказНаЭмиссию,
		//|	ПулКодовМаркировкиСУЗ.КодМаркировки,
		//|	ПулКодовМаркировкиСУЗ.ХешСуммаКодаМаркировки
		//|ИЗ
		//|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
		//|ГДЕ
		//|	ПулКодовМаркировкиСУЗ.GTIN = &GTIN
		//|	И ПулКодовМаркировкиСУЗ.Номенклатура = &Номенклатура
		//|	И ПулКодовМаркировкиСУЗ.ЗаказНаЭмиссию = &ЗаказНаЭмиссию";
		//
		//Запрос.УстановитьПараметр("GTIN", СтрокаТовары.GTIN);
		//Запрос.УстановитьПараметр("Номенклатура", СтрокаТовары.Номенклатура);  
		//Запрос.УстановитьПараметр("ЗаказНаЭмиссию", ДанныеЗаполнения.Ссылка);  
		
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Если НЕ РезультатЗапроса.Пустой() Тогда
	//		
	//		Выборка = РезультатЗапроса.Выбрать();
	//		
	//		Пока Выборка.Следующий() Цикл
	//			
	//			НоваяСтрокаТовары = ЭтотОбъект.Товары.Добавить();
	//			НайденныйЭлемент = Справочники.ШтрихкодыНоменклатуры.НайтиПоРеквизиту("КодМаркировки", Выборка.КодМаркировки);
	//			НоваяСтрокаТовары.ШтрихКодМаркировки = НайденныйЭлемент;
	//			НоваяСтрокаТовары.Номенклатура = СтрокаТовары.Номенклатура;
	//			
	//		КонецЦикла;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла; 
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") Тогда
		ЗаполнитьПоЗаказуНаЭмиссию(ДанныеЗаполнения);
	КонецЕсли;                         
	//-Шульман А. 02.10.2025 #UT10-5445
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуНаЭмиссию(ЗаказНаЭмиссию)  
	
	//+Шульман А. 02.10.2025 #UT10-5445
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗаказНаЭмиссию, , "Номер, Дата");
	ЭтотОбъект.Основание = ЗаказНаЭмиссию;
	ЭтотОбъект.Дата = ТекущаяДата();         
	
	Запрос = Новый Запрос;     
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаЭмиссиюТовары.Номенклатура,
	|	ШтрихкодыНоменклатуры.Ссылка КАК ШтрихКодМаркировки
	|ИЗ
	|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Товары КАК ЗаказНаЭмиссиюТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|			ПО ПулКодовМаркировкиСУЗ.КодМаркировки = ШтрихкодыНоменклатуры.КодМаркировки
	|		ПО ЗаказНаЭмиссиюТовары.Номенклатура = ПулКодовМаркировкиСУЗ.Номенклатура
	|			И ЗаказНаЭмиссиюТовары.GTIN = ПулКодовМаркировкиСУЗ.GTIN
	|			И (ПулКодовМаркировкиСУЗ.ЗаказНаЭмиссию = &ЗаказНаЭмиссию)
	|			И (ЗаказНаЭмиссиюТовары.Ссылка = &ЗаказНаЭмиссию)";
	
	Запрос.УстановитьПараметр("ЗаказНаЭмиссию", ЗаказНаЭмиссию);  
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл    
		
		ДобСтрока = Товары.Добавить();
		ДобСтрока.Номенклатура = Выборка.Номенклатура;
		ДобСтрока.ШтрихКодМаркировки = Выборка.ШтрихКодМаркировки;
		
	КонецЦикла;
	//-Шульман А. 02.10.2025 #UT10-5445

КонецПроцедуры

//+Пашкин О.А. 08.09.2025 #UT10-5414
ПроверкаУсловияНетДанныхКМаркировке = ЛОЖЬ;
//-Пашкин О.А. 08.09.2025 #UT10-5414
